Revit 2027 API
MEPFamilyConnectorInfo.GetConnectorParameterValue Method
 Gets the parameter value of the specified connector parameter id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterValue GetConnectorParameterValue(
	ElementId connectorParameterId
)
Public Function GetConnectorParameterValue (
	connectorParameterId As ElementId
) As ParameterValue
public:
ParameterValue^ GetConnectorParameterValue(
	ElementId^ connectorParameterId
)
member GetConnectorParameterValue :
        connectorParameterId : ElementId -> ParameterValue
Parameters
connectorParameterId ElementId
 connectorParameterId is defined in the family connector element.
Return Value
ParameterValue
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace